const clc = require('cli-color');

function draw () {

  var f0 = clc;
  var f1 = clc.red;
  var f2 = clc.yellow;
  var f3 = clc.green;
  var f4 = clc.cyan;
  var f5 = clc.magenta;
  var tb = clc;

  var layout = [
    // 'MacBook Pro Split Key Layout',
    '┌───┬───┬───┬───┬───┬───┬───┐   ┌───┬───┬───┬───┬───┬───┬───────┐',
    '│~ `│! 1│" 2│№ 3│% 4│: 5│, 6│   │. 7│; 8│( 9│) 0│_ -│+ =│ Bkspc │',
    '├───┼───┼───┼───┼───┼───┼───┤   ├───┼───┼───┼───┼───┼───┼───────┤',
    '│Tab│ Й │ Ц │ У │ К │ Е │ Н │   │ Г │ Ш │ Щ │ З │ Х │ Ъ │ Enter │',
    '├───┴───┼───┼───┼───┼───┼───┤   ├───┼───┼───┼───┼───┼───┼───┐   │',
    '│Cap/Esc│ Ф │ Ы │ В │ А │ П │   │ Р │ О │ Л │ Д │ Ж │ Э │ Ё │   │',
    '├───────┼───┼───┼───┼───┼───┤   ├───┼───┼───┼───┼───┼───┴───┴───┤',
    '│ Shift │ Я │ Ч │ С │ М │ И │   │ Т │ Ь │ Б │ Ю │? /│   Shift   │',
    '├───┬───┼───┼───┼───┴───┴───┴───┴───┴───┴───┼───┴───┼───────────┤',
    '│fn │Ctl│Alt│Cmd│         Space Bar         │  Cmd  │    Alt    │',
    '└───┴───┴───┴───┴───────────────────────────┴───────┴───────────┘'
  ];

  var keyboard = layout.join('\n');

  console.log(keyboard);
};

module.exports = { draw };
